ci4/app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`id_kategori` = '1'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`id_kategori` = '1'
ORDER BY `artikel`.`id` ASC
 LIMIT 10
---
public function admin_index()
{
    $title = 'Daftar Artikel (Admin)';
    $model = new ArtikelModel();
    $q = $this->request->getVar('q') ?? '';
    $kategori_id = $this->request->getVar('kategori_id') ?? '';
    $sort = $this->request->getVar('sort') ?? ''; // Tambahkan sort
    $page = $this->request->getVar('page') ?? 1;

    $builder = $model->table('artikel')
        ->select('artikel.*, kategori.nama_kategori')
        ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

    if ($q != '') {
        $builder->like('artikel.judul', $q);
    }
    if ($kategori_id != '') {
        $builder->where('artikel.id_kategori', $kategori_id);
    }

    // Sorting berdasarkan judul
    if ($sort === 'judul_asc') {
        $builder->orderBy('artikel.judul', 'ASC');
    } elseif ($sort === 'judul_desc') {
        $builder->orderBy('artikel.judul', 'DESC');
    } else {
        $builder->orderBy('artikel.id', 'ASC'); // UBAH INI: dari DESC ke ASC
    }

    $artikel = $builder->paginate(10, 'default', $page);

SELECT *
FROM `kategori`
---
        return view('artikel/ajax_list', $data);
    } else {
        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();

INSERT INTO `artikel` (`judul`, `isi`, `slug`, `id_kategori`, `status`) VALUES ('informatika', 'teknik informatika', 'informatika', '1', 1)
---
public function add()
{
    if ($this->request->isAJAX()) {
        $rules = [
            'judul' => 'required',
            'id_kategori' => 'required|integer'
        ];

        if (!$this->validate($rules)) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => implode('<br>', $this->validator->getErrors())
            ]);
        }

        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getPost('judul'),
            'isi' => $this->request->getPost('isi'),
            'slug' => url_title($this->request->getPost('judul')),
            'id_kategori' => $this->request->getPost('id_kategori'),
            'status' => 1
        ];

        if ($model->insert($data)) {

SELECT *
FROM `kategori`
---

    // Jika bukan AJAX, tampilkan form biasa
    $kategoriModel = new KategoriModel();
    $data['kategori'] = $kategoriModel->findAll();

DELETE FROM `artikel`
WHERE `id` IN ('9')
---
public function delete($id)
{
$model = new ArtikelModel();
$model->delete($id);